tests/stress/artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 30
      arrivalRate: 100
      name: Warm up
    - duration: 60
      arrivalRate: 100
      rampTo: 1000
      name: Ramp up load
    - duration: 180
      arrivalRate: 1000
      name: Sustained load
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
scenarios:
  - name: "Visitor flow"
    flow:
      - get:
          url: "/"
      - think: 1
      - get:
          url: "/login"
      - think: 2
      - get:
          url: "/signup"
  - name: "API Health Check"
    flow:
      - get:
          url: "/api/auth/session"